-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Servidor: localhost:3306
-- Tiempo de generación: 25-03-2019 a las 21:35:36
-- Versión del servidor: 10.3.13-MariaDB
-- Versión de PHP: 7.3.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de datos: `id5568929_japones`
--
CREATE DATABASE IF NOT EXISTS `id5568929_japones` DEFAULT CHARACTER SET utf32 COLLATE utf32_general_ci;
USE `id5568929_japones`;

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `marcas`
--

CREATE TABLE `marcas` (
  `idMarca` int(32) NOT NULL,
  `mkNombre` varchar(30) NOT NULL,
  `kanji` varchar(50) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf32;

--
-- Volcado de datos para la tabla `marcas`
--

INSERT INTO `marcas` (`idMarca`, `mkNombre`, `kanji`) VALUES
(1, 'ひゃく', '百'),
(2, 'えん', '円'),
(3, 'せん', '千'),
(4, 'いちねん', '一年'),
(5, 'こども', '子ども'),
(6, 'ははのひ', '母の日'),
(7, 'どようび', '土曜日'),
(8, 'ひ', '火'),
(9, 'つき', '月'),
(10, 'みず', '水'),
(11, 'き', '木'),
(12, 'おかね', 'お金'),
(13, 'つち', '土'),
(14, 'いま', '今'),
(15, 'きょう', '今日'),
(16, 'こんげつ', '今月'),
(17, 'ことし', '今年'),
(18, 'ほん', '本'),
(19, 'ひと', '人'),
(20, 'にほんご', '日本語'),
(21, 'おとこ', '男'),
(22, 'おんな', '女'),
(23, 'せんせい', '先生'),
(24, 'がっこう', '学校'),
(25, 'がくせい', '学生'),
(26, 'あう', '会う'),
(27, 'かいしゃ', '会社'),
(28, 'うえ', '上'),
(29, 'した', '下'),
(30, 'みぎ', '右'),
(31, 'ひだり', '左'),
(32, 'まえ', '前'),
(33, 'なまえ', '名前'),
(34, 'うしろ', '後ろ'),
(35, 'あとで', '後で'),
(36, '午前', 'ごぜん'),
(37, 'ごご', '午後'),
(38, 'なか', '中'),
(39, 'くに', '国'),
(40, 'ちゅうごく', '中国'),
(41, 'しろい', '白い'),
(42, 'はくじん', '白人'),
(43, 'おおきい', '大きい'),
(44, 'だいがく', '大学'),
(45, 'ちいさい', '小さい'),
(46, 'しょうがっこう', '小学校'),
(47, 'しょうがくせい', '小学生'),
(48, 'ちゅうがくせい', '中学生'),
(49, 'ちゅうがっこう', '中学校'),
(50, 'いく', '行く'),
(51, 'くる', '来る'),
(52, 'らいげつ', '来月'),
(53, 'らいねん', '来年'),
(54, 'かえる', '帰る'),
(55, 'やすみ', '休み'),
(56, 'はいる', '入る'),
(57, 'いれる', '入れる'),
(58, 'でる', '出る'),
(59, 'だす', '出す'),
(60, 'くち', '口'),
(61, 'いりぐち', '入り口'),
(62, 'でぐち', '出口'),
(63, 'じんこう', '人口'),
(64, 'め', '目'),
(65, 'かわ', '川'),
(66, 'やま', '山'),
(67, 'ふじさん', '富士山'),
(68, 'なに', '何'),
(69, 'なんにち', '何日'),
(70, 'なんようび', '何曜日'),
(71, 'まいにち', '毎日'),
(72, 'まいつき', '毎月'),
(73, 'まいとし', '毎年'),
(74, 'ともだち', '友だち'),
(75, 'たんぼ', '田んぼ'),
(76, 'やまもとさん', '山本さん'),
(77, 'まいあさ', '毎朝'),
(78, 'ちょうしょく', '朝食'),
(79, 'けさ', '今朝'),
(80, 'ひる', '昼'),
(81, 'ちゅうしょく', '昼食'),
(82, 'よる', '夜'),
(83, 'こんばん', '今晩'),
(84, 'ゆうべ', '夕べ'),
(85, 'せんしゅう', '先週'),
(86, 'こんしゅう', '今週'),
(87, 'らいしゅう', '来週'),
(88, 'まいしゅう', '毎週'),
(89, 'いっしゅうかん', '一週間'),
(90, 'とき', '時'),
(91, 'よじ', '四時'),
(92, 'しちじ', '七時'),
(93, 'くじ', '九時'),
(94, 'なんじ', '何時'),
(95, 'あいだ', '間'),
(96, 'じかん', '時間'),
(97, 'わかる', '分かる'),
(98, 'ごふん', '五分'),
(99, 'じゅっぷん', '十分'),
(100, 'じぶんで', '自分で'),
(101, 'はんぶん', '半分'),
(102, 'はんとし', '半年'),
(103, 'あのかた', 'あの方'),
(104, 'いきかた', '行き方'),
(105, 'わたし', '私'),
(106, 'ちち', '父'),
(107, 'おとうさん', 'お父さん'),
(108, 'はは', '母'),
(109, 'いえ', '家'),
(110, 'かぞく', '家族'),
(111, 'くに', '国'),
(112, 'ちゅうごく', '中国'),
(113, 'がいこく', '外国'),
(114, 'ひがし', '東'),
(115, 'にし', '西'),
(116, 'みなみ', '南'),
(117, 'きた', '北'),
(118, 'とうきょう', '東きょう'),
(119, 'とうようじん', '東よう人'),
(120, 'せいようじん', '西よう人'),
(121, 'なんべい', '南米'),
(122, 'ほくべい', '北米'),
(123, 'ほっかいどう', '北海道'),
(124, 'てんき', '天気'),
(125, 'げんき(な)', '元気(な)'),
(126, 'あめ', '雨'),
(127, 'そら', '空'),
(128, 'Ｓがすく/Ｓがあく/', 'Ｓが空く'),
(129, 'くうき', '空気'),
(130, 'はな', '花'),
(131, 'はなび', '花火'),
(132, 'かびん', '花びん'),
(133, 'おはなみ', 'お花見'),
(134, 'さかな', '魚'),
(135, 'きんぎょ', '金魚'),
(136, 'うみ', '海'),
(137, 'かいがい', '海外'),
(138, 'みみ', '耳'),
(139, 'て', '手'),
(140, 'じょうず(な)', '上手(な)'),
(141, 'へた(な)', '下手(な)'),
(142, 'あし', '足'),
(143, '～そく', '～足'),
(144, 'みち', '道'),
(145, 'すいどう', '水道'),
(146, 'えき', '駅'),
(147, 'あか', '赤'),
(148, 'あお', '青'),
(149, 'からだ', '体'),
(150, 'ぎん', '銀'),
(151, 'ぎんこう', '銀行'),
(152, 'でんき', '電気'),
(153, 'くるま', '車'),
(154, 'でんしゃ', '電車'),
(155, 'かみ', '紙'),
(156, 'てがみ', '手紙'),
(157, 'みせ', '店'),
(158, 'てんいん', '店員'),
(159, 'いぬ', '犬'),
(160, 'うし', '牛'),
(161, 'とり', '鳥'),
(162, 'はくちょう', '白鳥'),
(163, 'うま', '馬'),
(164, 'ばしゃ', '馬車'),
(165, 'にく', '肉'),
(166, 'ぎゅうにく', '牛肉'),
(167, 'くろ', '黒'),
(168, 'こくじん', '黒人'),
(169, 'おちゃ', 'お茶'),
(170, 'さどう', '茶道'),
(171, 'きっさてん', 'きっ茶店'),
(172, 'いろ', '色'),
(173, 'きんいろ', '金色'),
(174, 'ぎんいろ', '銀色'),
(175, 'ちゃいろ', '茶色'),
(176, 'もり', '森'),
(177, 'はやし', '林'),
(178, 'いし', '石'),
(179, 'ちから', '力'),
(180, 'たいりょく', '体力'),
(181, 'いと', '糸'),
(182, 'すき(な)', '好き(な)'),
(183, 'たべる', '食べる'),
(184, 'しょくじ', '食事'),
(185, 'しょくどう', '食どう'),
(186, 'のむ', '飲む'),
(187, 'みる', '見る'),
(188, 'けんがく', '見学'),
(189, 'いけん', 'い見'),
(190, 'きく', '聞く'),
(191, 'よむ', '読む'),
(192, 'かく', '書く'),
(193, 'しょどう', '書道'),
(194, 'としょかん', 'と書かん'),
(195, 'かう', '買う'),
(196, 'いう', '言う'),
(197, 'はなす', '話す'),
(198, 'でんわ', '電話'),
(199, 'かいわ', '会話'),
(200, 'たつ', '立つ'),
(201, 'しりつ', '私立'),
(202, 'おもう', '思う'),
(203, 'おもいだす', '思い出す'),
(204, 'すむ', '住む'),
(205, 'じゅうしょ', '住所'),
(206, 'あるく', '歩く'),
(207, 'はしる', '走る'),
(208, 'しる', '知る'),
(209, 'やすい', '安い'),
(210, 'あんしんする', '安心する'),
(211, 'あんぜん(な)', '安ぜん(な)'),
(212, 'たかい', '高い'),
(213, 'こうこう', '高校'),
(214, 'あたらしい', '新しい'),
(215, 'しんねん', '新年'),
(216, 'しんぶん', '新聞'),
(217, 'ふるい', '古い'),
(218, 'おおい', '多い'),
(219, 'すくない', '少ない'),
(220, 'すこし', '少し'),
(221, 'ながい', '長い'),
(222, 'しゃちょう', '社長'),
(223, 'こうちょう', '校長'),
(224, 'ひろい', '広い'),
(225, 'ちかい', '近い'),
(226, 'きんじょ', '近所'),
(227, 'さいきん', 'さい近'),
(228, 'ゆうめい(な)', '有名(な)'),
(229, 'うまれる', '生まれる'),
(230, 'いきる', '生きる'),
(231, 'もの', '物'),
(232, 'とめる', '止める'),
(233, 'とまる', '止まる'),
(234, 'はじめる', '始める'),
(235, 'おなじ', '同じ'),
(236, 'はる', '春'),
(237, 'なつ', '夏'),
(238, 'あき', '秋'),
(239, 'ふゆ', '冬'),
(240, 'はやい', '早い'),
(241, 'ただしい', '正しい'),
(242, 'たりる', '足りる'),
(243, 'たす', '足す'),
(244, 'せきどう', '赤道'),
(245, 'せいねん', '青年'),
(246, 'どくしょ', '読書'),
(247, 'しょうねん', '少年'),
(248, 'しょうじょ', '少女'),
(249, 'たぶん', '多分');

--
-- Índices para tablas volcadas
--

--
-- Indices de la tabla `marcas`
--
ALTER TABLE `marcas`
  ADD PRIMARY KEY (`idMarca`);

--
-- AUTO_INCREMENT de las tablas volcadas
--

--
-- AUTO_INCREMENT de la tabla `marcas`
--
ALTER TABLE `marcas`
  MODIFY `idMarca` int(32) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=250;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
